[
  {
    "comment": "   \n  Battery life, display is superb\n   \n  I wish I could say, you get what you pay for. This is not even worth what I paid for.   \n   **The screen wobbling of this laptop in just hyped up, It wobbles only if you move the laptop roughly or when you move the lid roughly and intentionally. The screen doesn't wobbles on rough typing. Therefore screen wobbling is just hyped up.**   \n  I really like how with the competitive price victus come with but built quality could have been better specially hindge, the screen is noticeably wobly, if you are using on desk its fine, if you use on lap or under running fan can easily notice the wobble.\n   \n  Bought this laptop with lots of expectations as specs are very good but it gets freezes for a second randomly which is very irritating. It is happening for normal work. So don't buy this laptop. Very annoying freezing issue and hp customer care not able to resolve this issue.\n   \n   It's just the wobbling issues everyone complaining abt...I know it's there but for a gamer like me it's not an issue since I don't move my laptop 100 tyms a day...it's doesnot wobble under ceiling fan and all like some people mentioned in their reviews...it's been weeks since I bought it... Haven't found any problems....The main thing abt this laptop is that the heat/thermal management....I play for abt 7 hrs or more everyday...in a single stretch 3 or 4 hrs... and all these tyms I haven't had any major temperature strike or low performance issues...the thermal management is pretty damn efficient....the screen is another fact to talk abt...its 100% RGB and very bright compared to many other laptops...it's sound system is also pretty good...but who cares abt sound system since we gamers use headphones all the time while gaming... anyway the laptop have a decent sound system...the wobbling issue is something that we will observe very quickly... especially when we place it on our lap or when we try moving it around or while touching the screen...better not place this laptop on your lap bcz gaming laptops want air supply and the air intake is in the bottom. Placing laptop on your lap is Harmful for us too. The ram is not single 16gb...it 8gb and 8gb in two slots...that's a small disappointment...the laptop have all the ports you will ever need and it also supports dual force...through which you can use wifi and Ethernet simultaneously to increase network speed...even though it is made of plastic..the finishing looks good....it's got hdmi 2.1 which is the latest hdmi port...which support larger video quality and fps...got a nice keyboard which feels simillar to Mac book keyboard...mac book's keyboard is better anyway...got window key lock function and touchpad lock function( mainly used by gamers)...3 USB ports...1 usb type c...hdmi...Ethernet...single port for audio and microphone jack....sd card slot...the keyboard have an white and blue mixed backlight which looks cool...the overall look of the laptop is great...which can be used even for productivity purpose (not over flashy design)... Battery life is 3 out of 5....since it's gaming lap it's recommended to plug and play most of the tyms....personal opinion: Go for it\n   None   \n  Gaming is not better as it stops while playing and battery life is decreasing day by day I want refund for it\n   \n  It's not the best laptop , but really worth for its price and victus is able to manage a no. of high end softwares simultaneously, although haven't checked about games ,but high rendering softwares work fairly without any problems.   \n  The product is really nice. The screen wobble is still there but not too much. The brightness and screen quality is really good. The weight is well distributed and the build Iapetus is pretty good. The battery is not long enough but ok taking into account that it is a productivity laptop. Really worth the price.\n   \n  Great screen, value for money, no issues till now. Let's see further.\n   \n  The display of my newly bought VICTUS by HP has turned faulty on day 10 (see photo).   \n  Cons:   \n  Designed by HP Engineers is the worst thing written on this HP VICTUS laptop.   \n  Good for coding and gaming. Laptop does heat up, but has good thermals. Screen hinge quality is sub-par. Other than that it's a good laptop.   \n  One of the best laptop\n   \n  Decent graphics card and works well on aaa games . Powerful processor geekbench 5 gives 8312 on multi core and 1526 on single core . Satisfactory speakers but not too loud or macbook level . The brightness is satisfactory for normal everyday work and gaming.   \n  I wonder why does people say there is no heating issues. When I keep my fingers at center of laptop keyboard, my fingers are getting burnt. Pergaps keys coming below F5 to F10 (this might be the place where cpu held underneath).   \n  Built quality is awesome as usual by HP.   \n  Pretty good laptop in the price segment. The 100% Srgb display is really good for design works and it has ms office also which is very nice considering a gaming laptop. Thermals are also good.\n   \n  This is a great laptop. Looks sleek and provides ample compute power to handle intensive applications/games without any issues.   \n  This is a Beast in this price segement   \n  Laptop is worth it. Screen wobble is there but its manageable. No heating issue.\n   \n  This laptop easily fit your budget. Overall performance is great & smoothly. No Heating issues noticed till now. CPU & GPU temperature near about 80-85 degrees. Battery Backup 3-4 hrs (Normal usage). Build quality average. Gaming performance very good. No major issues noticed during playing games.\n   \n  Firstly, the laptop had a small scratch on the lid but that doesn't bother me much.   \n  Overall a great laptop for gaming\n   \n  Still buggy ryzen battery 3.5-4 hrs in general usage no heating issues not yet game performance is exceptional 5/5.brightness is ok for indoor display wobble for normal fan speed build quality 3/5. Recommended for hp lovers one thing is clear if we don't want to search for port hub ms office it's free here previously iam using macbook air m1 too hard for a windows user to adapt bit restricted except in weight and battery life there is a bit bugs keynote word numbers not even open shows dailog box whenever I try to open ms office still to acclimatize m1 chip my oneplus phone struggles to connect Mac so it is not my type so I came back to hp previously omen user except in weight everything is ok. So please go for 89k victus which covers most. 100℅ srgb rtx3050....\n   \n  I've had this laptop for about 2 weeks now, so here's my review   \n   I bought this as I got good configuration in this price. But it feels very bad plastic have been used and literally shaking below normal fan speed. I mean I have to work under the shade where there is no wind. I have returned and got it again but with same defect. Also seller written 16GB single slot RAM. But after complaining and return I got same 2 slot 8GB RAM. Screenshot attached. This means I am not able to upgrade it afterwards. Physically yes but basically I have to throw these two 8GB ram and have to purchase and install two16GB. This is very annoying. HP is a good brand but this is not at all satisfactory. I have requested amazon also for double checking these issue and return but they are also not customer friendly at all.\n   \n  Pros   \n  I won’t comment on wobble as I feel it’s exaggerated than what it actually is, everyone following a “trend talk”.   \n  Mrp is  ₹1,08,000...   \n  Wifi hardware is not working. Updated drivers, bios etc. Hp folks promised onsite support. No one has called or visiting. Extremely disappointed and dissatisfied.\n   \n  I like the fact HP provide a laptop with rtx 3050ti + ryzen 7 5800H + best screen of 100%sRGB and also battery life+ owsome build quality (hats off🤠🤟🏻) i.e., quite good 70Whr and much better than 50Whr or 56Whr like many other brands, overall verdict :-Go Ahead and buy it *[screen wobbling is present little bit more because of bigger size of screen may be but hey!! There is no laptop in this range which don't wobble whereas hinge of victus is quite tough no problem with hinge and no flex]\n   \n   Let me start by what I didn't like   \n   The product is awesome no issues with the build quality but there is little shakyness in the screen even if we the laptop is under a ceiling fan.   \n  I was planning to buy this laptop so i went through qna section for the same and saw that ram is 16gbx1.. but when i got the product it is actually 8gbx2. Now if we wish to upgrade it then either of the 8gb Ram will be wasted.   \n   It easily produces 80+ fps in medium graphics on most games. Build quality is good. Doesn't have any major flex neither on screen nor on keyboard. Screen display quality is also great, 100% srbg. ( 3050ti + 5800h). Build feels solid in hand and battery backup on normal usage is upto 5 hrs\n   \n   Hp really should do something to fix screen wobbling issue by recalling to service centers, this issue should be taken seriously as u can see in the video I compared it with my old Asus DM 483 with one broken hinge and there is no wobbling under fan, this is a bad remark on relaibility, This laptop does deserve a five star rating if not for screen wobbling issue, and tested some AAA games on this so far so good, and thermals are really good, CPU maxing at 85°C and GPU At 75°C, and a worthy mention is keyboard which super good for the price range.   None   \n   My initial impression about this product was very good . But after few days it started to show some wired bugs   \n  First, look for the disassembly video on YT. This shows you all the internals and how to upgrade the laptop. From the references to PCIe 4.0, I'm assuming that is the Intel model, as the Ryzen is PCIe 3.0 only. So don't expect the second SSD slot to be PCIe 4. It's not. I haven't used this extensively and not played much, just a few games to test it.   \n  Would have given 5 stars if not for following flaws   \n   For gaming , best build quality, premium quality\n   \n   I just love it... Fast charging features is really very fast. Looks like Charger weight is defining its fast charging features... - ;)\n   \n  It is a beast pc overall\n   \n   THE SCREEN WOBBLES BUT NOT A PROBLEM, CAUSE ACTUALLY SCREEN IS HEAVY , BESIDE THAT PERFORMANCE IS TOP NOTCH SUPERFAST, GAMES RUN SMOOTH NEAR TO 80 FPS, THERMALS ARE EXCELLENT NEVER GONE UP TO 85 DEGREE, THANKS TO @gamingsetupdeals (telegram), for fast delivery trick, thanks amazon for two day delivery.\n   \n  First let's get the elephant out of the house. Does the Screen Wobble? Yes. More than other laptops? Yes. But, it does not wobble while typing or gaming when placed on a table. The price to performance ratio is exceptional. Not only the specs are mind blowing but the display is a treat to our eyes! 🤯 like on a whole new level (3050ti & 3060 version). It smokes any other gaming laptop in terms of battery life. It's just amazing. The keyboard quality came like a shock to me. It's so good that it pleasures your finger while typing. Perfect travel and resistance. It's just smooth! Those were the initial impressions. More in the coming days....\n   \n  Awesome\n   \n  I ordered got it delivered in 15hrs ,which is amazing and the laptop is heavy ,also it has only mid support for the screen so do handle with care , but apart from that the specifications are on point , it's a valid HP product got it verified from the warranty check on HP website.   \n   My Reviews on the Laptop are based on continuous gaming usage for 4 hours. My Laptop is the mid variant 5800H/RTX 3050Ti/16 GB RAM/512 SSD.   \n  Display is really good! (144hz display is a treat to the eyes)..Built quality could have been better(screen is not sturdy it wobbles sometimes but it is very thin with very less bezel which is good)... vents are good, no heating issues...It is a bit heavy 2.5kg weight.....battery life is not very good (4 - 5 hrs max in power saving mode) and also there are two 8gb ram i.e total 16gb ram whereas HP said it comes with one 16gb ram..Ryzen 7 5800H processor is a beast..RTX 3050ti is a very decent graphics card...Overall the performance of this laptop is very good....I think in this budget range it is the best entry level gaming laptop you can get online.\n   \n  TL;DR. It's a 7.5 out of 10.   \n  Everything is perfect in this laptop it's all plastic but still have good thermals. Display quality is nice   \n  Thermals are good, excellent display, decent battery life.\n   \n  Before buying this laptop I used Dell G3 3500 I must say that I am happy to return that and I purchased this Laptop.   \n  First of all I will say a very big Thanks to gaming  setup deals for getting notification that this laptop is in stock  . If u want to know that this laptop is in stock and want to get notification then simply go to telegram and search for gamingsetupdeals and join where u will get lot of loots and deals   \n   I underestimated the screen wobble issue initially but at 90,000, I'm not satisfied with the hinge quality. The screen just moves around with a tiny poke.",
    "name": "Victus by HP Ryzen 7 5800H 16.1-inch(40.9 cm) FHD Gaming Laptop (16GB..."
 
  },
  {
    "comment": "   \n  Good enough for gaming\n   \n  I was looking for a desktop replacement for my home use. Not a hardcore gamer, just a guy who played games like COD, Project IGI, GTA, different NFS titles in college and some years after. So while replacing my years old desktop, thought of buying a so called \"gaming laptop\". Requirements were clear - laptop but not necessarily an ultra portable one (as mobile phone works well while on the move), expandable hardware (specially RAM), without any bias for AMD or Intel, have to be fairly latest and must be value for money. Though selected couple of others also from Lenevo and Dell; HP was most value for money of them. And 10th gen Core i5 with 8GB DDR4 (expandable to 16GB for sure), 512GB SSD, 1650Ti graphics card, 15.6 inch FHD display was enough for my need, with a budget of not crossing 60k after all discounts - this laptop is a good fit for my requirements.   \n  First and farmost thing: Its a pain to have this laptop.   \n  For this price range, this is one of the best products to opt for if you are interested in gaming/online class/daily chores, basically for students and regular use.\n   \n  Laptop is awesome\n   \n  Probably the best gaming laptop you can get for this budget. Gives 50-60fps for most games on high settings. Load times are incredibly fast, and it does not overheat. The battery life is on the lower side. Do not expect more than 3 hours of usage on a single charge while using a video calling app like zoom.\n   \n   If you have the budget, GO FOR IT. No need to look on anything else. Firstly, it can be said, a laptop that runs game well does general works well. This model is tremendously fast and capable. I'm playing Days Gone PC at max settings (even with reshade applied to enhance quality furthermore), and no lags I could notice. A great option at this price. And you've HP's brand value and trust too.\n   \n  Very nice laptop...powerfull for gamming...sound and display quality is also good... running smooth... boot time takes around 5-8 sec... thanx to 512gb ssd... and the intel optane in superd we can use total of 40 gb as system memory\n   \n  Best performance laptop under 70k.... better performance, good for gaming, good performance in Editing.... Battery lasts more than 3.5 hours with continuous useage with internet (without gaming and editing)......display was good graphic designers can go for it......No heating issues at all...speaker is clear, crisp and awesome it's a different experience on speakers..... hardware is quite good... Design as expected in pictures...   \n  Very good product\n   \n  Wonderfully laptop with bad battery backup   \n  Bang for the buck.... This machine is 🔥🔥   \n  Camera Quality is very Poor & Some times Device Lags alot & battery backup is upto 3 hrs maxxxx so kindly buy other laptop\n   \n  Nice product\n   \n   Horrible experience with the laptop. First of all I received one product which was a used one then asked for a replacement and now the new one has keyboard issue and Spacebar issue. Don't buy HP laptops these are terrible. Not sure whether it is a fault of the vendor or HP but my experience is terrible with this.\n   \n  Very impressive design and build quality performance is best in this price segment, sound quality is awesome and display is excellent also battery life is also normal, gaming performance is excellent no doubt\n   \n  AFTER 10 DAYS OF USAGE:   \n  Performance is awesome\n   \n   We can use this for multipurpose...   \n  It is a very good laptop at this price range. The speed and performance is good and can be used for multiple purposes other than gaming, like video-editing , photoshop, office work etc. The speed can be enhanced by adding additional RAM. (Most compatible RAM for this model)\n   \n  Battery life is vey poor. I think I cannot work without keeping the charger on... The charging is also quite slow.\n   \n   GTA v work v I love it best even I play more super great music please buy this I watch\n",
    "name": "HP Pavilion Gaming 10th Gen Intel Core i5 Processor 15.6-inch (39.6..."
  },
  {
    "comment": "   \n  Best display, build quality also good and performance is amazing.\n   \n  It is a very good laptop for gaming ang productive work like online office or classes. It's battery life is very good when ur not playing any games but when playing playing games the battery will drain in an hour or so.overall I played Minecraft,fortnite and GTA V the fps are good and the laptop does not heat at all. It's SSD is also very fast so it makes the experience much better. I overall this is the best laptop I have ever seen in this price range.\n   \n  Not camera high quality Very low and performance cpu ram is good average   \n  Best in segment at this price range.\n   \n   It's a value for money deal. Great for gaming with different software adaptation modes. Super responsive screen 144Hz, RGB keyboard and the software is too good. For browsing and online classes, the battery may last upto more than 3½-5 hours on full charge. No heating issues. Upgradable SSD and HDD along with the RAM is a bonus.\n   \n  Screen was defective product  corners of screen is not fixed correctly and got some yellow light. and the worst delivery experience they thrown the laptop box in complete bottom of all item and laptop box came loose box inside laptop has no safety than this laptop is crazy awesome I can suggest it every one .\n   \n  best budget gaming laptop\n   \n  Great laptop with GTX 1650ti\n   \n  Very fast boot up . Good for working and games .\n   \n  Best product\n   \n  Quality is Good speakers are not that good..... AND GAMING BEAST 🔥\n   \n  I review it after a month , performance is great there is no lags in display the built  quality is also superb you never feel it's plastic body, it,s like a metal which is good. but I not get ms office 365 for life time it was installed in but for only trial, where I think they cheat in this category. So all the performance and quality is good you can buy without hesitation. If you not prefer their trail versions.\n   \n  I just bought this product on Aug 26 and today being sept 6 laptop will not charge.  Return policy was valid till sept 3 it is either seller (Appario) provided a defective product or product itself is defective. I will try calling seller to fix or will be taking a legal action in court.\n   \n  gaming experience was nice   \n  Battery backup is not as expected  but overall it's really good one\n   \n  Great computing machine with an amazing price.\n   \n  Speed and performance top notch\n   \n   Display have tint issue, first product I exchange because of this,then I got with more tint issue,the laptop is a good one,bt don't buy from this sellers\n   \n  Don't think twice just buy it !!\n   \n   Awesome laptop for multitasking in this price range RGB keyboard is awesome and it takes around 4-5 secs to boot all because of SSD I believe and also there are no heating issues found battery lasts around 3hrs if we continuosly listen online classes it can be upgraded to Win 11  The only thing disappointed me is this variant is without MS office activated  camera quality is very good I expected a more battery life but as it is a gaming laptop the battery backup is ok and thanks to honeycomb design it really helps in heat dissipation as mentioned it meets military standards and when in charging turbo mode is activated which helps a lot only one small suggestion plz keep refresh rate @144Hz so that you will not face any screen blank issue for 2-3 secs when you connect or disconnect power source. I recommend this laptop to everyone who really wants to achieve something in their life and hidden features like MYAsus are add on for this laptop. I liked the RGB keyboard and the stickers provided in the box.\n   \n   Awesome\n   \n   Good laptop under 65k\n   \n  awessome\n   \n  Laptop is best for this price range but screen blinding is very high   \n   For all those tuf gamers. Those who dare\n   \n  I'm happy with this buy for around 64K (before card discount). The build quality is good, the screen at 144Hz is more than suitable for gaming. Battery isn't much of an issue for me, but the backup does seem to be on the low side.   \n  Asus tuf f15 1650 ti model   \n  Best gaming laptop\n   \n  I had recently purchased the laptop, as a whole the laptop is amazing but the screen seems to be flickering.\n   \n  Best laptop and work simultaneously gaming and any work and all over Best Quality Best price and screen good quality body 👌👍\n   \n  Buy it without any second thought for gaming. Best laptop in this price range but there is battery issue.\n   \n  Decent features for this price range   \n   Not workimg\n   \n   like this asus tuf f15 gaming lap   \n  The battery backup is good.   \n  Got is crash and black screen error 😫 on initial system bootup\n   \n  Like\n   \n  Overall the laptop is superb for everything but the problem is that it don't come with the microsoft 365 , but it show that it is included. This is the bad for me that why they show that it is included.   \n  Guys After i received my laptop i checked screen bleeding test. Very high screen bleeding. Guys be alert. Check your laptop ASAP after receiving. I called Amazon and opted for replacement. They said they'll in 24-48 hr. So let's see what would they do. Be alert Heavy screen bleeding🚨🚨🚨   \n  Good design, better finishing, smooth running, average 3½hr for normal usage and 1 hour for Gaming..   \n   ASUS gaming laptop..a worst choice.. we purchased one.. screen is blurred lights from corners.. if you put AC DC Adapter the screen will off for few seconds..when we contacted Amazon for replacement.. they simply say that contact Manufacturers.. Please don't buy expensive items such as laptops from Amazon..\"limited liability - simply says 7 days replacement or refund but nothing.. Amazon thieves..\n   \n  Good for work and gaming 👍  reviews after 2months of usage. Battery life is also good. Mostly used for work and sometimes gaming. Play almost all games with high fps. boot time is almost 5-8sec. Overall best and fast product.\n   \n  Excellent Laptop\n   \n  Snappy and responsive. A great buy.\n   \n  Everything is good in this laptop ..every single features is just wow but wo bat hai na achi chiz me ek burai rhegi wo hai battery life(very poor)..It is written that battery life is 7hrs(mazak hai kya😆)..Hardly 4hrs in normal usage and watching flims you can get upto max 5hrs\n   \n  Great product   \n  This laptop is great for its price, it is the best gaming laptop for this price but if you are going to use thisfor gaming you need to turn off battery boost from nvidia geforce because the fps gets capped at 30\n   \n   Laptop is awesome 😎, sleaky design attracts everyone and the sharp edges makes it much more pretty and brush finish at keyboard and all over the body makes it look rich.   \n   Why u gave me useless product,,,.....I ordered 9th aug. and delivered 13 th aug bt after 7 days(20th aug  )  ...and toady 21st aug. when replacement period has over ....I opened laptop nd suddenly show horizontal line on laptop .... what the hell is this man   \n  Very good performance\n   \n  Best Laptop for Programming.\n   \n   Best Display :-Fhd at 144hz is just a eye candy..Anti glare coating does not strain the eyes neither gives headache...its super smooth cuz of 144hz..but not for video editing or content creation because of its 45% ntsc color panel,   \n  I didn't use this for a long time but I'll write a review anyway.   \n   Best labtob in in this prize I got this Amazon sale   \n  Using for design work and experiencing good response of hardware.\n   \n  Gaming performance is awesome.. smooth screen ...144hz..i had tested Rdr2 in it...i get 35 fps avg in ultra settings.. overall its a value for money product.\n   None   \n  I got this beauty 2 days ago. Packaging and delivery was good, no issue there.   \n  The whole support is also not good.\n   None   \n  It only can handle for mostly  for two hours\n   \n  I like performance, battery backup is abt 2 hrs ..abt value  for  money i would like to rate it as 4 out of 5\n   \n   The laptop is simply a beast the only con I find is that the webcam could have been slightly better else the specifications is just amazing.\n   None   \n  Best Buy Good Configuration Strongly recommend\n   \n  Super product but package was very WORST\n   None   \n  If you need performance , go for it!\n   \n  Got this laptop within 24 hours. Amazon's one day delivery is quite good ,the packaging was proper . The laptop is very good I loved it ,I tried playing valorent on high graphic settings and got around 120-125 FPS which is really good. The battery backup is also good.\n   \n  Good product\n   \n   For the price, I think the performance is justified. I5 10300H is not that bad as people say it to be if you main purpose is playing games. But if you want to do workstation loads I would suggest Ryzen. Performance: The only game I played till now is Warzone. The game has become demanding I would say that much. If you are in some open area like farm fields you'll get around 65-72fps but if you are in lets say downtown you'll get around 57-65fps. Upgrade it 16gb for better performance. Now mine is 1650ti, if you go for 1650 expect some 6-10fps less. Thermals: This is the area I see people complain about most in TUF laptops. Again its not that bad as people complain it to be. I turn on my AC and the temps doesn't cross 88°C which is normal for a gaming laptop. Display: Smooth 144hz no complains there. Color accuracy, well - its decent. Like I mentioned before if you only want to game the colors are good. You can message me on instagram if you got anything else to ask. Its dannyy___18 but dont ask me to run workstation programs.\n   \n  It's really very good laptop @63990 with GTX1650ti GPU with 120htz refresh rate..   \n  The delivery was on time, after 2 days of use. I can say that   \n  The laptop can't even be used continuously for 1 hour. Very bad battery backup\n   \n   Product is defective\n   \n  This is the best in this price range. Playing Mafia definitive edition smoothly in high settings. Absolute beast, can't explain it in other words. I am really happy about it. Sound is very good when compared with other lappys. Been using this for about a week.\n   \n   laptops performance so good but one genuine issue battery backup only 2 hrs backup   \n  I Just Feel like the battery drains faster than you could imagine. Overall its just 4 Hours of Mixed Use.   \n  RGB looks so good. I changed some settings and  played valorant it gives 144 fps constant   None   \n  Laptop works superr but 45 gb storage was reserved qnd only 455 gb was usable   \n  This laptop has met the expectations. It has all the features, it is fast and Performing well. It can handle intenssive Gaming and little bit editing. Only important thing it missed os MS Office. It would be great if MS office home is preactivated in laptop.\n   \n  Using it for a week now, GTA 5 and Assassins creed origins are running smoothly.  Battery back is around 4.5 hours in normal office work.\n   \n  Kindly add more images of laptop for clear idea. Buyers and sellers kindly upload images of laptop front and laptop closed design like...closed laptop images.... opened laptop images\n   None   None   \n  This is first day of my Laptop, The Look and Body is what i was expecting it to be, the speakers are very good and loud ..but a little disappointed with the loud noise of the fans even in silent mode, in turbo its like a hair dryer,writing this as this is my first feel of the product ..have to check about battery and performance.\n   \n   I am using this laptop from last 1 month  and this is awsome laptop. No thermal issue if you are playing game  I played valorent , Gta 5 , Apex legends etc. So I didn't feel any thermal issue.   \n  Excellent laptop. It is beast and highly recommend for gaming and normal use.\n   \n  It ticks all the boxes in terms of specification and configurability.\n   \n  A powerful laptop in this price range. Cooling system is nice.. Go for it\n   \n  Awesome laptop.. you can get awesome display with 144hz ..   \n  Very nice gaming laptop in this price 👍 👍  👍 👍 , only the battery life was short, otherwise very nice.....\n   \n   Perfect leptop for all works\n   \n  Battery life is Only around 2-3.5 Hrs on general Internet/YouTube usage.   \n  Laptop stopped working after one day, display is off\n   \n   This is a overpowered machine in this budget segment. I got this in 58k (i5 10th Gen, 512GB SSD, 8GB RAM, 45Whr Battery, 144Hz).   \n  Using it purchased on 27/7/2021 and will update pros and cons\n   \n   Writing this after using the lap for 3 weeks,   \n  Nicely packed good product\n   \n  Value for money   \n  For gaming its the best laptop in this price range, battery is also good you can get 2 and half hour of battery life, definitely value for money product\n   \n  I bought it on the prime day . This is the budget beast !!! GO FOR IT  🔥🔥🔥🔥🔥   \n  Awesome product\n   \n  got this latop for 63990rs in amazon sale. just started using it and i am loving it. lets hope i dont face any problems if any happens i'll update here also.   \n  The best laptop you can buy for 60k\n   \n   Best value for money you can blindly  trust for this gaming laptop it's battery life is good\n   \n  Op   \n  Excellent product at this price .   \n   First purchase   \n  Not a single problem well packed good delivery dont worry about the dealer .the reviews about them are rare case .u can buy from here itself no prob.and the product is amazing. I like the body of the lap very much\n   \n  I have bought  this laptop on 8th july this year and after 10 days the left speaker is producing crackling sound whenever i play some sought of sound......i cant carry on my study and other stuffs....😤\n   \n  Brillaint! Just loveit!\n   \n  Its been Month i am using this Its so nice for Gaming ..I am playing GTA V it Gives 60fps avg.. and sometimes gave 100+ while plughed ...when Unplugged rare FPS Drip for couple of Sec...And Valorant was like 120+ But Battery drains So fast...but for Gaming so Good as we Play while Plugged\n   \n   Best In segment go for it, got for @61999 6 days delivery time. laptop is in best condition and every thing is working. Screen Is Dam Good and Clear 144hz. wifi6 4gb graphics etc.   \n  Performance is great, battery backup is everage\n   \n   Go for it...At this price range there is no other competitions\n   \n  Heavy battery\n   \n  Best for gaming!   \n  I was just making a report on word and using google chrome simultaneously. And look at the temperature of laptop. Literally I scared so much. The feeling was like carrying a bomb on my lap. But this was only just once. Overall I loved display, battery life and speaker.\n   \n  Worth your money. I intended to purchase for my design purpose (SolidWorks / Lumion 11 / Fusion360. etc) which I was unable to run on my i3 sys. It's working very smooth now on this machine.   \n  Good Services & prices   \n  Its worth the price.. build quality looks premium.. and fast performance..\n   \n  Probably the best laptop that you can get from Asus for this price range (Around 62k when I got it). Great entry/mid level gaming laptop, excellent build quality and ergonomics, of course don't be expecting great battery life on this but it can hold up to about 3-4 hours easily (not while gaming though), It can pretty much run any AAA titles on medium at 1080p 60fps (Can crank up some older games to high/ultra) with no lag whatsoever and that 144hz refresh panel while playing FPS games like Doom or CSGO is so satisfying! Overall a great portable gaming station....\n   \n  Best laptop in this price\n   \n  It's a fine laptop but the problem I got whenever it switch from battery power to AC ( or try to charge the battery) there is flicker in screen   \n  This product is value for money\n   \n   Performance 4.5 gaming 4.6 battery 4.1 speakers 4.7\n   None   \n  Awesome Product at this price range, super fast, Boot within 5 sec, Speakers are load enough, Full HD .. awesome clarity..pre install Windows 10, No MS office installed, have to installed by own, Backlit RGB keyboard is awesome\n   \n  Don't think just buy it!   \n  using it for almost 20 days got ram upgraded to 16gb and added a 1TB HDD works smooth.Got it for 61990+3700(HDD)+4700(RAM)\n   \n  It's really good in this price range💯💯💯\n   \n   There is no issue at all and people say that used product received and damaged and all (not at all true )   \n  It's fast and good enough for gaming. Battery backup is poor as any other gaming laptops.\n   \n  Best in 61000₹   \n   Really a great purchase . VALUE FOR MONEY . IT IS A BEAST GAMING LAPTOP UNDER THIS PRICE RANGE . It has a Turbo mode which is automatically enable when u use your laptop while charging. This prevents the laptop to heat . It is really Awesome Purchase . Delivery is on time i got my parcel in 5 days .   \n  Bought this laptop to work on my Android freelancing projects.   \n  You can upgrade it accordingly your need likewise RAM, SSD, HDD etc. If you are searching for midrange gaming laptop don't go for lenevo Ligon or IdeaPad nor hp pavilion or acer nitro just choose tuf f15 and results are just amaze.\n   \n  Every thing goes nice   \n  Iss me Microsoft office home nahi hai. Aap ko aalag se buy kar na para ga. Ye seller jhut bol raha. Baki sab laptop me mast hai.\n   \n  Very satisfying product no issues...awesome build quality and design....loved it..\n   \n  It’s a good laptop for entry level gaming but he laptop I purchased the screen died after a month.\n   \n  Top performence\n   \n  Way Too Awesome , i5 10300h paired with GTX 1650 Is Beast And 144 Hz Screen Is Lit🔥🔥🔥🔥🔥🔥🔥.\n   \n  A good laptop. Value for money and the gaming experience is quite good, the performance is also quite good.\n   \n   Defenitely can buy it . A good product within 62K .   \n   This is the best laptop with the price range i can say, for gaming its perfect with 144hz refresh rate can get max 120fps with lowest settings and with high arround 70-80fps which is actually very good. Then battery is also okok as its a gaming laptop so u cant expect more.. but yes its fine. Its value for money under 61k with 144hz which no other brand provide. People who used hdd for long long time they will be happy like me, literally 3-4secs to boot- damnnn u will love it.   \n  It had earthing issues, I feel vibration on the metallic body of it when plugged in charger.\n   \n  Display wasn't properly sealed with its bezels and it was leaking the display light from the edges where it was creating white spots! Please check this before the return window is over!   \n  Laptop is good and perfect.....   \n  It's a bad choice to purchase anything  from asus. No product  last for more then a year.  I am saying with my personal  experience\n   \n  Value for money\n   \n  Gaming 👍   \n  So far in use for about 1 n half month and no problems.. games like apex legends, farcry5, forza4, days gone run above 70 fps..and the 144hz really ia amazing for multiplayer overall its a good gaming laptop but interms of battery gaming it only gives 30fps and does not even last for 1n half hour for gaming normal coding and offc work it will last for 2 n half or 3 hours.. but it gets kinda hot while big games.. its okay if the room temperature ia maintained.. id definitely suggest in this in this price warzone only gives 55-60 fps in medium settings but in low it can boost upto 70 fps.. for a 60k laptop its great, valorant above 130 fps\n   \n   Awesome 👍 product can do any work perfectly.\n   \n  It's value for money for me.   \n  Has RJ45 port. can connect max 3 screens ..4-5 Hours backup on saving .. On performance mode around 1.5 hour.   \n  This is a beast no heat no lag it should be more expensive than that it's so good it's the beast simply\n   \n  Great laptop\n   \n  Backlit keyboard with cool design.   \n  This laptop is awesome only con is that battery and it have some heating effect , heating effect can be managed by having a cooling fan so overall it’s really an 🔥🔥\n   \n  It arrived with a good condition but after 2 days it's display went off!! Applied for the Replacement let's see how it works now!!\n   \n  Very nice laptop.\n   \n  The product is in good condition. Amazing product, just go for it and it is a value for money.\n   \n  Good laptop I can say no problem until now every thing is excellent as company specs this is best lap in this segment\n   \n  The specs are good but faced many problems with the laptop. Had wifi disconnection problems, the display goes out, and many others. Their service center is the worst of all. First, they respond like after a week if at all they do. Sometimes they have not raised a complaint yet even after you raised like multiple times and no qualified technicians and they are very rude. You will feel regret as to why you bought their product.   \n  laptop is best but battery and camera disappointed me\n   \n  It's not worth spending money on this brand. I have notice mostly motherboards and inbuilt keyboards  starts giving problem after some time. And worse is the after sales support\n   \n  Laptop switched on but nothing is displayed on screen   \n  There's a display issue on the laptop, don't buy it from amazon   \n  only 4 core and start heating in 10 min when we play HTA5 worst product please dont buy the product\n   \n  Screen bleeding started just after 10 days and then when i went to service center they told me to wait for 1 month, so keep in mind about these things before buying it   \n  Love The Product .......\n   \n  This is one of the best laptop under 62000 and I will definitely recommend you this under this price range.   \n  My laptop arrived in a good condition but just after 2 days it's keyboard stop working and now I have placed a replacement let's see how the new laptop works\n   \n  Great lappi\n   \n  I got this laptop for 62k, for that it has a good spec to price ratio. I won't call it a bang for the buck but the price is pretty good.   \n   Best laptop for gaming\n   \n  Value for money 💯   \n  First of all, I love Asus because they never disappointed me. This particular laptop at 62K is a bargain IPS display at 144hz is a gangster, blacks are awesome, Call of Duty Warzone is amazing, although RTX will be even better but you cannot expect RTX at this price, I don't think there is a better laptop than this in Amazon India right now with with i5 chip at this price either gaming or non-gaming. This is also blazing fast in browsing and heat dissipation is engineered to perfection. Overall a great buy. Upgrading memory and disk size is a piece of cake as Asus already provided extra slots for both, once again thanks to Asus for making Amazing machines. Amazon delivered it earlier than promised despite pandemic lockdowns.\n   \n  It is an absolute value for money, best for gaming in budget, and for using CAD and other designing softwares. Excellent Screen Resolution for Movies and Games. Only hiccup I have is that it should have come with Office 365 free for a year as how it comes with other laptops which are less than its price range. ASUS should look into that as it is mianly used by students so MS Office is a critical feature for the students.   \n  Excellent performance in all respects. I like and recommend everyone to purchase this Laptop without hesitation.Great build qualities & easy to handle because it is portable. By & large it is good in all respects. It would be much better if it's weight is reduced by a little bit. Performance is awesome. If someone wants to purchase a high performance laptop, then he/she can go for it.\n   \n   I bought this product 2 days before and the product which was delivered to me was the worst defective peice ...the speakers were damaged and not producing the full sound ..it's recorded in phone that's why it's loud but in love the sound is not good and the voice is not heard and the surrounding sound doesn't works and the battery life drains in low performance i.e within one hour ... Asked for replacement but they gave me refund option .. now I have to reorder this again\n   \n  Overall it's a good laptop bt the performance is slow while multitasking and video editing\n   \n  My laptop arrived in great condition but just after 2 days of normal usage it suddenly died and did not turn on at all.   \n  Good performance and speed with smooth and fast gaming experience. However long gaming requires with charging on. Very good product and recommend at price of 62K.\n   \n  for the price point i am absolutely stunned.   \n  I have had 2 Asus laptops and both of them had severe manufacturing and quality control issues. However this one which i ordered from asus website deserves a special mention:   \n  Good product and its value for money\n   \n  Go for it...\n   \n  Got this awesome laptop today. Took 10 days for amazon to deliver this order, but that might be due to the covid situation. The laptop is a bit heavy, but thin. The \"grey\" color on the top is actually darker than what's seen in the pic. The screen is fabulous. Tried valorant in it today and it was okay. Gave 160fps in medium settings. There's no MS subscription but there's a one month xbox game pass.The boot up time is around 3-4 secs. i5 10th gen with 1650 is good, although 1650Ti or 1660Ti would've been better. But I suppose they can't sell laptops with such GPUs for 62k. The backlit keyboard is awesome too.The battery is okay.\n   \n  Just go for it ! Best gaming laptop... U will get 60 + fps for high end games ! Dont expect much from the battery tho - its normal its a gaming laptop ... Display is wonderful and the performance is mind blowing !\n   \n  Battery life is Okey , and other things are superb\n   \n  I bought this laptop for my son the device functioned smoothly for a day however, on second day the power went off without any warning and the laptop is dead since. The Amazon people arranged  replacement however due to device not starting replacement was denied and cancellation of order was suggested, which has been done. The point is when customers is buying such a costly product quality should be ensured otherwise it is pointless to buy online where there is so much fuss to get replacement.\n   \n   Overall you will get all the things you are looking in this laptop and everything will work just great ......just 1 con is the \"CAMERA IS NOT GOOD\".....IF YOU WANT A GOOD WEBCAM JUST THINK AGAIN. otherwise just go for the laptop it looks way in real life than photos.\n   \n  All rounder, worth money ,except battery and overheat issues\n   \n  A product that stand near it's promises,if you're mid range gamer then this is your laptop for sure.screen quality isn't that good in sunlight,About battery life as you can see any laptop you buy for gaming don't give you that much battery while playing without charging\n   \n  For gaming goood, battery life aint so sustainable overall good deal\n   \n  Amazing laptop for the price, if you want to go for a budget gaming laptop this should be your go to, upgradability is also very good with empty slots for easy upgrade of ram and ssd\n   \n  Its good to use...\n   \n  The best laptop for students\n   \n  Good gaming performances,Simply Awesome for Gaming. Suitable for high games like Gta 5,watch dogs 2 and many high games. Etc\n   \n  This Laptop is Awesome For Gaming / Coding /Editing . Don't think Just Go For It ... Its aa beast 😍😍😍😍😍😍\n   \n  Super 👌\n   \n  Hey what are you thinking just go for it. This thing is a beast. It looks more better in real than in photo.\n   \n  Awesome,I love it\n   \n  Very nice laptop but only bad thing that it has a very short battery\n   \n  Recieved in a perfect condition and am happy with the out of the box feeling. Will update after a few months of usage .\n   \n  Ignore the negative comments I got the delivery in 3 days product came with sealed registered warranty geniune accesories #happy product\n   \n  What could I say more, it's awesome laptop, excellent performance for gaming, heavy coding and for other video related editing works, got this around 62k, good colorization and everything's great, screen is awesome no worries such as screen bleeding.\n   \n  ★Don't buy this laptop...   \n  The Paking Box of the laptop was damaged I don't know how a strong box like this can be damaged. I was very disappointed seeing that . Amazon should atleast check the items box before delivery.\n   \n  Display is really good with 144hz refresh rate.   \n   All thing is good sound quality is nice but not so loud , camera is below average, booting time is awesome, heavy but very thin laptop battery backup is ok , the dhansu RGB backlit keypad is awesome and also wasd keys are highlighted, I haven't tried a game yet so I'll edit the review for performance impreasion in some days.  This is a beast in 62k segment\n   \n  Brought it for my cousin its been a few months and they are completely happy with that laptop, till now at this budget i cannot find a better laptop, only concern is its service and all i don't know if there will be proper service available in kerala or not.\n   \n  I OURCHASED THIS LAPTOP RECENTLY. I AM VERY HAPPY WTH MY PRODUCT. ASUS HAS NEVER MADE ME DOWN. THE PERFORANCE IT PROVIDES IS JUST OUTSTANDING AND WITH THE GTX 1650, IT BLOWS EVERYTHING AWAY. 8 GB RAM IS ENOUGH WHICH CAN BE UPGRADED TO A MAX OF 32GB RAM AS PER REQUIREMENTS. SSD IS ALSO VERY FAST. MY SYSTEM BOOTS UP IN LESS THAN 3.9 SEC. VERY VERY HAPPY BUYING THIS PRODUCT AND RECOMMEND YOU ALSO TO DO THE SAME.   \n  A pack of awesome-ness from asus. Its made in china. But performance and looks are great. Got it under 62K best perfomance under this price range.\n   \n  1. Great performance on heavy audio editing software.   \n  OverPowered Specs for the price!   \n   I got this laptop under 62k and I love this laptop, it's jst amazing, solid bulid quality, looks simply sexy, very smooth as well as fast and it's 144hz screen was cherry on cake but it feels quite heavy otherwise it's an amazing laptop. If ur budget is approx 60k then close ur eyes and buy this without any doubt.......\n   \n  Killer speed killer look\n   \n  Never buy it.",
    "name": "ASUS TUF Gaming F15 Laptop 15.6\" (39.62 cms) FHD 144Hz, Intel Core..."
  },
  {
    "comment": "   \n  Frankly speaking this is the best Laptop i ever had!   \n  Totally impressive just go for it\n   \n  Laptop is top notch. Only thing missing in the box was stickers. Guess some one has removed it before packing the box.\n   \n  To start i can say, I am extremely happy with the laptop as previous user of Lenovo laptop i give my entire overview of this laptop   \n  Received it yesterday it is a very good laptop with good build quality battery backup is around 6 hours(if rgb is off and on 50% brightness and dedicated gpu off) camera is ok ,all ports are working well, physical bill is not included with my laptop leaving that everything with the laptop is good.\n   \n  2nd day review will update if something happends   \n  Just Got this Laptop. The build quality is very good. The display is excellent, wasn't expecting it to be this good.   \n  Best thing you can get at this price... its working fine... i am not able to boost the ram frequency to its max potential but youtube helped... only issue i had was with igpu feature that was not working properly mainly software issue hope they fix it soon... the most amazing thing was its battery... i have used it above 6 hours with moderate usage from 80%... and the thermals are really great👌\n   None   \n  This is a good product I got mine in perfect condition. Just check for screen bleed and temps otherwise everything is just perfect.\n   \n  This laptop has impressed me as well as disappointed me on some fronts...   \n  It's best in the market ...I got brand new laptop without any external or internal issue ..Go for it you are not gonna regret\n   \n  The product is completely fine. Brightness control is not working both before and after updates. It can be an issue from amd or windows side. But facing this issue in a brand new product is not something a customer wants after sending 75k. Driver updates , microsoft basic adapter nothing works. Replaced the product.\n   \n  Blindly go for it!   \n  No Screen Bleeding or Fan Noise while not gaming or  any other such issue in my unit. Display is a bit dim even at 100% brightnes , but its fine!   \n  Great laptop will be better after bios update   \n   Everything is perfect about that laptop.... But I'm not satisfied with Amazon's packaging, Laptop Box from asus was perfect but Amazon's outside additional box was not properly sealed and not jerk proof ..... So regarding e-commerce packaging , I must put 0/5.....   \n   Wow every thing perfect in just 75 k wow...\n   \n  My first Laptop and I have to say this is worth every single penny!!  Just go for it you won't regret.🔥❤️   \n   The laptop is quite well built. Has a good screen with much brightness for indoor uses. The keyboard also feels nice and the RGB has 4 stages of brightness. Will not get into the performance part yet because I have got this product just now.   \n   I had purchased asus A15 ( r7 + rtx 3050 ) laptop on 9th sept and it was working fine till yesterday.   \n  Just go for it, didn't face any kind of screen bleeding .\n   \n  Till now i have played only valorant and the highest Cpu temps were 70 deg and for the gpu 65 deg. So the thermals in the 2021 modeal are good.   \n  Purchased on sep 4 2021, delivered on sep 6, raised return request on sep 7 2021.   \n   I'm speechless😂🙌\n   \n  Everything is great from the build quality to backlights of keyboard but the display is little irritating for gaming so if you want a clear display so don't buy it otherwise it's great worth of money\n   \n   Can i know whether it's screen bleeding or not? Otherwise lap was awesome\n   \n   Ordered on 4th Sep 2021 and received on 5th Sep 2021. Machine is perfectly fine and works as expected, except the screen bleeding.   \n  This is the 2021 variant. The images in the listing is for 2020 so don't worry you'll get the lastest R7 4800H RTX 3050 variant. Just received this an hour back and the I like what I see. Have seen a lot of reviews on YouTube to be sure that the performance is definitely worth the price. If there are any issues in this laptop then it's probably specific to my item and not the laptop in general. For 75k it's a steal. Go ahead without thinking twice!   \n  I would love to buy this product. The product seems to have power packed specs. The price range is perfect too.\n   \n   I ordered it on 31 aug and I got this on 4 sept so I m really happy and 5 stars for the delivery   \n  solid build   \n   Best laptop ❤️\n   \n   Ausome performance. & good build quality. Love it   \n  Well, I was little sceptical after reading one of the reviews say this is refurbished.   \n  Update 2 -   \n  It is a great deal and amazing specifications in 75k and have 75w dynamic boost in RTX 3050 with 8 core 16 thread processer\n   \n  This is refurbished, Don't waste your money. Do you believe this good product for 75k, don't waste money. Very very disappointed\n",
    "name": "ASUS TUF Gaming A15 (2021) 15.6-inch (39.62 cms) FHD 144Hz, AMD Ryzen..."
  },
  {
    "comment": "   \n  I haven't received the free head set\n   \n  It's very Good Lapi, I ordered 512ssd + 32optane, I Got 144Hz display which i was not expected. U Will Get only 477GB space a little compromising But we can add extra ssd also. Every thing is Perfect but u got 4 hours battery life and in gaming  u get 2 to 2.30hr battery backup.   \n  I am an architect and have been finding right pc for me since very long, after going through a lot of options finally purchased this one and I am so glad I did. I am using it since a month now It works amazingly, the graphics are good, it doesn't take much to open any arch softwares, battery is good, easy to carry, all the features are superbly working..\n   \n  writing the review after 15 days. The product delivered is exactly matching with the description on Amazon app.   \n  I liked the way it boots up. No lag at all. The only thing that I felt negative about is the storage space.\n   \n  This review is after using the laptop for a month.   \n  Higher study\n   \n  Good product\n   \n  Well in all aspects\n   \n  The laptop stopped working in exactly 7 days after the warranty... HP very well calculated.\n   \n  The laptop is working amazing' so far.\n   \n   Recieved the laptop this morning and the screen has been flickering since startup. Spent nearly two hours with HP customer service trying to troubleshoot the issue, but to no avail.   \n  Just a first look of this device.   \n   The only problem laptop has is that the hinges are made cheap material , because of which the breakers after some , and in some cases you might not able the lid of the laptop.\n   \n  Only backlog is battery remaining all good\n   \n  Dont but it if you buy   None   \n  Overall good for average gamer+study\n   \n  This go laptop is probably best in category becaof it’s price and improved design. Gaming laptops can heat up quickly damaging the motherboard. However this laptop has better design to accommodate the vents at back of the laptop. It helps. Laptop is not heating even after almost & hours of continuous working. Would have been more happy if HP would have given 11 th Gen at this price\n   \n  Hi All,   \n  Purchased this product mainly for using Mechanical CAD software. The built quality is very good. Cooling mechanism for long gaming hours is good.  SSD drive makes booting faster.  Graphics card gives very good display.\n   \n  I like this product\n   \n   It has been 1-2 years since i am using this laptop so i am writing the review after thoroughly using it.   \n  Before telling about pros and cons.   \n  camera please improve and overall nice laptop\n   \n  The screen is so delicate that we might get afraid that we can break the screen\n   \n  Battery backup is Compromised while gaming Like Pubg, Shadow of Tomb Raider\n   \n  BEST IN GAMING.GOOD CAMERA QUALITY.BATTERY LIFE IS SATISFACTORY.\n   \n  Nice product, No issues up to now\n   \n  Nice\n   \n  Good system for beginners to enjoy the experience of gaming.\n   \n  I am sharing this review after 2 days. The product is good more than my expectation. Good in Working speed, Keypad is flexible to use, Camera is not so clear. Packaging was worst.\n   \n  Delivered on time meeting the expectations of package and handling. Only thing that should have been as cons is Price should have been under 63k. If you are tight on budget then seems to be gr8 for gaming. Boots within 8-9 seconds. Intel Optane is doing a great job.\n   \n  Awesome\n   \n  i played minecraft with shaders and without shader high settings and its giving me 200-300 FPS without shaders and 60 FPS  with ultra shaders\n   \n  Warranty issues guys!!! Except that some 3 or 4 HP bloatware apps. Rest I assure AMAZING AMAZING AMAZING. Better than Acer Aspire 7. A 100000 times better.\n   \n  Battery is very poor and major problem is heating issue.  Not found warranty card in the box. Overall satisfied. .\n   \n  This laptop has great build quality overall best budget gaming laptop 🔥🔥🔥🔥😍😍😍😍and it's smooth for gaming I buyed the mouse also now I can play great games\n   \n  Good product\n   \n  Very nice laptop for overall college usage (MSO pre-installed). Gaming has no issues, playing on 144hz display feels very good. Battery backup I'd say is average 2.5-3hrs(just surfing). 512 gb ssd is not enough for me, if it's enough for you then it's worth buying !\n   \n  Repaired in 3 wks of time. Product is not working\n   \n  Beast 💟 laptop I loved it . It's awesome . . . . . . . . . . .\n   \n  The Laptop is good but Camera should have been better. I know its for gaming but one might need for work aswell 🤷\n   \n  Nice\n   \n  dko268tx  it's one of the best model in pavillion awesome looks.it's just amazing and you can play heavy games won't get too heated I have tested while playing valorent.it's best both for professional and gaming.As I said earlier it's one of the best model from pavilion\n   \n  Best products but battery backup is very low and also camera quality is bad\n   \n  Check Warrenty & Serial number of the product first i got wrong product\n   \n  A good internal specifications product with low wearing body and keys. Purple keyboard light is not very helpful in low light. The 15 in width hides the fact that the height has been reduced and plastic edge filler used. Keys are wearing out within less than warranty period. Please do not buy this product as the key wearing is very bad. Warranty says cosmetic issue. So even if all print comes off till plastic in first few months of warranty it is your problem not a manufacturing defect. I urge you to buy DELL or ASUS or even Thinkpad. From experience they do not have this issue\n   \n  good\n   \n  Its a fine laptop, great for gaming only con is that its a dust and fingerprint magnet\n   \n  Very nice project. Sometimes hearing issues otherwise fully satisfied\n   \n  No regrets. Totally love it\n   \n  Got the laptop on 19th June.  I was calling customer care to buy hpcare package and its been 2 days and call wont connect most of the time, Even if it connects, they are mentioning that they are not aware and forwarding the call to concerned department couple of times before disconnecting.   \n  Good for gaming and development software. Can handle best amount of processing at once. Also android studio works better.\n   \n  Great product\n   \n  Poorest performance and cheap display looks like kalaignar TV\n   \n  Very nice\n   \n  amazing performance 😍🔥 but battery 8/10 ✌️\n   \n  Built-up Quality is very good. Only the issue is battery backup and camera quality.\n   \n  Google\n   \n  NO PROBLEM JUST GRAB IT\n   \n  I had a problem while updating windows and it fails to start up. I contacted the seller and they quickly replaced it with a new one. Now, it is working smoothly.\n   \n  Ok\n   \n  this product is good\n   \n  Overall Product is good for gaming, camera and battery life but issue with office key...it is not working showing access use of provided key(license no). Request to seller, please share new office key for smooth use of ms office.\n   \n  Its a really good laptop.Starts up in 3 -5 seconds.Doesnt heat up. Good battery life.Go for it! (again its an electronic item so fingers crossed you get a good piece)\n   \n  Love it. Blindly go for it.\n   \n  Horrible Battery life and bad experience with Amazon and HP..\n   \n  It's a good product\n   \n  My son has only used this for 2 weeks but it is very impressive for gaming and normal use for his needs.\n   \n  camer worst, battery 2nd worst..\n   \n  Battery backup is the worst. It doesn't give backup for 2 hrs also.\n   \n  Awesome laptop\n   \n  Warranty is almost out as per HP record and Seller is not tracable, neither getting any help from Amazon buyer support.\n   \n  battery and speakers are average.boot up and processing speed is fast and gaming is smooth\n   \n  The laptop was good , but i got the defected piece. Battery or charger  was defected. It has a 63watt charger, but it charged 11% in 3 hours\n   \n  Great laptop for the price. Can run heavy games at medium settings with good fps.   \n  For gaming, camera, battery🔋 it not good\n   \n  All are good\n   \n  Best laptop for gaming at this price. Camera quality is as usual nothing special. Battery life is good when not gaming. Boot up speed is fast thanks to ssd. You need to update it's warrenty. As default this product's warrenty starts from date of manufacturing but in real it starts from day of purchase so just talk with hp customer care.\n   \n  You can play games with higher quality and all, but there is a problem for \"gamers\" you will deffinetly recognize the screen isnt that good for gaming like 60hz is noticible but overall this machine is powerful and compact it is a beast at this price.\n   \n  Great laptop , good for a casual gamer, but can give little bit heating issues , but that is not a major issue, thermals are good , but if you play for 2 to 3 hours continuous then it will heat up instantly\n   \n  4.5 rating out of 5 for the gaming performance and other performances, build quality,sound quality, all are good. . But not satisfied with the battery backup (as I expected)   \n  If you have a high budget, go for 11 gen or ryzen 5\n   \n  Wonderful laptop with amazing design and professional look. Best choice for all the gamers.\n   \n  Best quality product , good gaming experience boot speed is very fast. You can go for it\n   \n  I purchased Laptop on 23.02.21, but when I checked warranty of the same on HP support page, it shown Oct-21 (only 8 months). Then I contacted HP support through mail by giving invoice copy and P slip. HP support given reply we can’t update warranty of this Laptop as it was switched on before sale.   \n  Good laptop but they sended me a half months warranty expired laptop have to replace it.. check well the started date and warranty period\n   \n  I don't know much about it. I feel neutral. I want buy this product in future. Good specs. Would like to know more.\n   \n  Always lags, always needed to restart anyone one reading from HP please help me please will be waiting for your guidance\n   \n  The hp warranty service is not clear. Overall It is excellent product for working in machine learning domain.\n   \n  battery life is not good hardly 2 hours\n   \n  Good for gaming.camera is good and battery works long time.\n   \n  Key board is not properly lighted. Better could have been white keys\n   \n  I only got a warranty for 9 months instead of 1 year.   \n  It's , nice .\n   \n  After using one month..it started lines and black spot on the screen and even though HP 1yr warranty..they are not providing free service... saying that it is chargeable need to pay to avail warranty service. Worst experience I had ever in my life\n   \n  Very nice purchase on amazon.   \n  Utterly bad experience of exchange, old laptop everything works fine still not picked up withoutany reason !!!\n   \n  Excellent product, go for it. Only camera quality is not Upto the mark\n   \n  Batter life is even worst than my 4 year old mobile of 1+ 6T   \n  bought it for android studio n that works smoothly\n   \n  The boot time is so fast even with the dual boot and the laptop works so smooth. Amazing, apne amazon se.\n   \n  Great value for money\n   \n  This is so amazing laptop for playing heavy games.\n   \n  I loved the laptop, it is super amazing...it is a huge upgrade from my previous Gen pc so I just loved it.. great for gaming, working and streaming content.\n   \n  As great as it may seem, the design is the poorest of choice. The way screen is connected to the main body puts a lot of pressure on the screen hindges. these hindges breaks off quite easily. Plus the repair cost of these hindges comes around 12000. This is so absurd.   \n  Super fast.\n   \n  Affordable by common people who’s son or daughter perusing BE computer science.\n   \n  Everything is perfect , really value for money product !\n   \n  camera is not upto the mark. For gaming it's fantastic, I'm thrilled. Obviously it depends on what u play. Performance is up to the mark.Grab it.\n   \n  Be aware of defective model:   \n  Perfect for students\n   \n  superb\n   \n  Wonderful product. Sturdy Build. Loved the quality of keyboard. The HD Camera quality could have been improved though.\n   \n  For gaming it's beast...   \n  For gaming its good but battery life is very bad\n   \n  Good for price- warranty given was only 9months and product registration date shwown was few months earlier than I purchased. So make an enquire before purchase.   \n  Good for gaming only... However delivery of product fall short of expectation. Suggest do not for delivery date mentioned by Amazon\n   \n  Yesbiys good to use\n   \n  Awesome product, but supplied with 8 month lapse warranty.  bought in feb 2021 but warranty already started from july 2020.  Regarding warranty, No solution provided by Amazon. but thanks to Amazon the product was replaced with a new one.\n   \n  Great laptop overall. It really is a laptop worth gaming on. My experience with the laptop was a great one.\n   \n  Superb laptop\n   \n  Product is average but old stock sold by seller.only six months warranty given by HP and worst customer service of HP .avoid purchasing by this seller.\n   \n  Great but there is warranty mismatch hope they solve it, so please check after receiving it.   \n  Just amazing product. Go for it.\n   \n  I bought this laptop on 19 February 2020 but its warrantee already started a few months back.\n   \n  The product doesn't have mcafee security anymore, You will only get it if you are buying it in the past. 👀   \n  Plz dont buy it i am writing review after using 20 day it's window's are damaged\n   \n  I like the look good   \n  Veryyyy goood, loveee ittt\n   \n  The laptop has some great specs like 9th Gen Intel Core i5 Processor 15.6-inch Laptop (Core i5-9300H/8GB/512GB SSD/Windows 10 Home/4GB NVIDIA GeForce GTX 1650 Graphics.   \n  I am a office goer but your product didnt gave me PRODUCT OF MS WORD. MS EXEL, MS ACCESS. How can I work.\n   \n  The laptop seems good, but had problems with warranty (only 6 months was left) and that suggests that laptop was used or opened, so Amazon replaced it. The second replacement received had trackpad issues, and Amazon denied a replacement, so HP engineer came and checked and asked Amazon to replace it with a DOA order, and it seems Amazon does not understand what this means. Even after the DOA order by HP, Amazon agreed at first but later denied to replace, and the price had increased, plus was not getting free emi for 12 months. In the end Amazon agreed to give cashback but without any emi option. What a shame, wasted 15 days just with all the ruckus and misinformation shared by Amazon agents, these agents had limited knowledge, and no idea of matters outside their system.\n   \n  good\n   \n  Over all I really like this laptop. Been using it for three months and got no issues. The laptop has matte finish and is prone to fingerprint stains but other than that a solid computer\n   \n  Hp 'pavilion \"!! Wao really nice n amazing laptop, it has a great sound quality!! And camera also is great yo.. But u could have better camera but it's cool. N screen is awsome graphics are great especially the most admiring thing in this lapy is keyboard it's really amazing!!   \n  I bought this lap for 60K during republic day sale..The lap looks so good... performance beast..but except the battery ..It drains fast even in new condition..so,better go for asus if u need battery life with same performance..\n   \n  Graphics Card is being bottlenecked due to a low number of cores in the processor. Thus instead of giving a constant 60 fps in high quality as it is supposed to, it runs at 45 fps at high quality which further drops during long hours of gaming.\n   \n  Good looking laptop which is very capable and portabl.   \n  For the delivery i got the product 2 days before the specified date and the amazon box was in ok condition .I think the packaging should be improved by amazon .   \n  The laptop got delivered quick and safely by Delhivery💯. The laptop is built well and feels solid. Be careful when you open the laptop as the hinge is in the center and it seems fragile. Battery life is alright for a gaming laptop. The camera quality is really poor for 2021. The back panel gets smudged with fingerprints really quickly so you will have to always clean it. Overall, a solid and genuine laptop.   \n  After purchasing only I came to know that, NVIDIA graphics not performing as it configured in online. Speaker, camera connection issues are started.\n   \n  I don't write anything, because this a Gift for a nearer.\n   \n  I ordered this for my brother who works as a programmer. The battery life is awesome. It lasts over 4-5 hours after charging when he is working.   \n  As usual, amazon sent the item with good packaging.   \n  One of the best laptop for gaming and multitasking. Design is very good, battery is quite good. I love this laptop.\n   \n  Mid range gaming laptop\n   \n  Nice Gaming Laptop   \n  The functionality of the laptop is great. However, the hinge on the laptop completely came off for me, so did the bezel.\n   \n  Performance wise very good, display is also very good.\n   \n  Don't buy it , it's not good for gaming because it's refresh rate is only 60hz which we only give you upto 60 fps in any games max 😭 , whether u have GTX or rtx on it ...   \n  Nice for gamers\n   \n  Product is good but in comparison with other companies's laptop like acer,asus etc.   \n  Good quality, light weight,silent...Good value for money.....Thermals are really good. Fans are silent....The keyboard is good...touch pad is good...The camera is really really bad....Microphone is fine.....Battery is okay for a gaming laptop....Speakers are not too loud but quality is good.....screen is okay...\n   \n  Seller sending defective and used laptops.. this is the second laptop I have ordered from the seller both are having touchpad issue. Very poor from Amazon\n   \n  All good\n   \n  Battery life and camera quality is average, for gaming it is good laptop. I have cocern with warranty period, warranty started 5 months before purchase.\n   \n  High quality gaming, great performance and takes gaming to a whole new level and does complete justice to its price.\n   \n  Good laptop.   \n  Stopped working after 6 days so don't go for this product and faced so many issues in laptop returns and when finally product returned and recived my payment.So overall I am highly unsatisfied with service from seller and Amazon and  finally I think we should not buy costly products from Amzon from this seller.\n   \n  Rocket speed used for 15 days\n   \n  Not value for money product , very Overpriced product .   \n  Overall laptop was good but the only concern about Laptop charger and it’s getting heated immediately when we plugin\n   \n  This is the best gaming/Office Work laptop out their at a 60k budget...As Always HP doesn't disappoint Their customers ✅🙏Dont Think Twice!! Go For It\n   \n  On paper this seems good, but the hardware and manufacturing quality is low, in my laptop, hinge broke lose from display panel housing so i couldnt close the laptop,as the tension is very tight, the screws are very tight on motherboard , i needed to install nvme, but i couldnt, as the screw wouldnt come out,so i just tapped it, plus the cooling is really bad, it may have good processing unit, but higher the processing power it will have higher will be the heat and you will end up buying a cooling pad, or you should replace thermal paste if you can do that sort of stuff, i tired doing that too,but screws of heat sink wont came out, infact i ended up wearing of the grove of that screw, so just in 2 years am getting frustrated with it. Also the battery replacement aint easy to find especially from amazon and flipkart, you have to go for websites with low trust factor, nut that goes fro Omen too as they have same battery as this  .\n   \n  The laptop has amazing speed as expected. Boots in 3sec or less. Gaming is smooth, most games can be played at medium to high rendering but not ultra.   \n  Review by my kids who uses the laptop:   \n  I have using this item for 4 months and so far it has been performing excellent, I use it for editing and it works well with premier pro. Not used for gaming so don't know about it but for editing it works really well and boot time is 4 sec which is amazing.\n   \n   Crap quality. Bought this from hp world in August.  In just a week the f5 key came off. The keyboard is extra flimsy. As you can see in pics. Even took the extra three year warranty. Now for last three.months the sc say part is not available. Now they say there is no warranty for keyboard. Also asking for Rs.9000 for the keyboard. Such a flimsy stuff costing at the most maybe a Rs. 1000 on this very site lol. I do have an hp nx7400 which I am using since 2007. This laptop shows how bad hp has become. Better buy some other brand at this price.\n   \n  Pros:   \n  It's good for gaming but the battery last for only 5 hour\n   \n  I like the laptop except the Webcam. It performs poor in low light condition.   \n  good\n   \n  Great design and great build quality and not too thick\n   \n  For gaming it is best in budget and graphics of games is so good and fabulous  . And it's battery life is average. About thickness it is good as like other gaming laptop.\n   \n  Good laptop on ssd battery backup 4 hours normal use & gaming 2 hours battery life but ok thank you\n   \n  I bought this for around 63000.   \n  EXCELLENT Performance..   \n  this product is awsome.... fab.... extraordinary mind blowing.......🔥🔥🔥🔥🔥🔥\n   \n  Nice\n   \n  Working good with great features.\n   \n  OK SO HERE ME OUT ON THIS....   \n  Battery life is decent but not satisfactory,   \n  The SSD makes it fast. A small thing that potential buyers should think - the keyboard is black and the background is also black so in slight dark it gets difficult to see the keys. Solution: You can turn the backlit on for the keyboard or you need to turn the room light on :)\n   \n  Boots up within 10 seconds.  Smooth & great performance. Loving it.\n   \n  Decent purchase\n   \n  The product was awesome but i was a littlr bit upset with the package of the product.   \n  within 15 days it is dead... the return window closed.. the laptop not charging and not turning on.. it is very disappointing for me... don't know what to do... please amazon look in the matter\n   \n  Looks: Design of this Laptop is Awesome.What I like most about it is speaker grills and cooling vents design on top and back. The glowing LED illuminated power button is very aesthatic.   \n  Very good\n   \n  Fine for light gaming.\n   \n  Good\n   \n  There is a better option there in replacment for this this laptop with same price range 'Msi gl65 leopard 9SCSK which comes with i5-9300H, nvidia geforce gtx 1650 ti , 512gb nvme m.2 ssd and ips panel with 60 hz refresh rate . The main difference between msi and hp laptop is that msi gl65 leopard comes with grx 1650 ti but hp comes with only gtx 1650\n   \n  A beast for gaming , the gtx 1650 works charmingly , a decent battery life for a gaming laptop. The only lacking, resulting in giving it the 5 stars is its 500GB ssd storage. They could've easily provided us with 500GB ssd with atleast 500GB hdd storage.\n   \n  If your bugdet is 70000 to 80000,you should buy this....\n   \n  great purchase, just try to get this on discount and you're done ✅ great product\n   \n  Nice product\n   \n  I was looking for personal pc not for gaming and it's best configuration available at this price during prime day sale. Using since 1 month and working like charm for my daily use, office work.\n   \n  Very nice\n   \n  Very bad customer support, system hangs while playing. Raised service request, issue is not resolved even after one month.   \n  Item defective or doesn’t work pl Return it\n   \n  One of the best gaming laptop by hp at this price range. I am in love with this product and i would recommend everyone to buy this\n   \n  As everyone else pointed, the performance is incredible with regards to gaming and other stuff.   \n  Battery backup only 2 hours   \n  Works just fine.\n   \n  Good build quality, performance and asthetic look\n   \n  Goood Product. Excellent performance. Good Battery backup. Speaker has low volume.  best price 60 k.\n   \n  Very powerful laptop. Also very fast boot time.but battery backup is very bad\n   \n  System is overall good but it lags in turning  on and turning  off of screen ..please check before buying\n   \n  After 20 days of use laptop has stopped working and when I take to the hp service center they found the motherboard got damaged.very disappointing\n   \n  Firstly ,Battery life is not good .. it's comes with 33% battery and within 2 mins it becomes 7% and then in 2 sec laptop locking .. secondly , there is no bill and no warranty card with this product delivery . If a person wants any repair of product within warranty period how can he/she will do that without a warranty card or bill .\n   \n  Best entry level Gaming laptop backed up by good service\n   \n  First off, this item is sold in India only by Amazon retailers. You won't find this on offline stores because it's not made for India.   \n  I love it...... HP has to improve but still this stuff is not bad....I mean this is really good as a cheap gaming laptop!!\n   \n  Ealier, I was using Macbook pro and i had to buy another laptop. I was very confused which laptop would be suitable for me? I decided to buy a laptop with following configurations (under my budget): Atleast 8 GB ram, SSD, high clock speed, and no heating issue. After using the MacBook, this laptop did not feel smooth to me. Touch pad is not good at all. For me, linux OS is most suitable OS. I installed ubuntu 18.04 and it works perfecrly. During installation, i faced no issue. After 2 months of use   \n  Very bad ...they have only old item ...they delivered damaged not working product ...even not refund\n   \n  Product is osm only problem is warranty .  backdated warranty , i purchased on 31 oct but warranty starts from 22 july , how dont know ??pls respond ...\n   \n  Best and Perfect Laptop...   \n  Value for money , can use not only for gaming but also for work purposes and it doesn't gets heated because of its dual fans. So impressed go for it.\n   \n  There's nothing to dislike coz my son has learnt from it and has been very useful for all types of learning activities.\n   \n  Specifications for this price range:   \n  Gaming purpose and work purposes it is an amazing laptop, there are few other options to go for at this price but this is also fairly good, it's a bit heavy but that is because it is a gaming laptop\n   \n  I love the lappy\n   \n  Nice battery life, fast booting process\n   \n  No purchase recipt in the box....what the hell is going on?\n   \n  Perfect 💜..... got in sale at 63k.\n   \n  Now, I'm regretting buying this laptop   \n  Very poor product..😵... After 6 months its OS is two times  complained and then the screen on white rounds are appear... now is filled the white rounds. Now it is not used..... My cash is lose....😡\n   \n  Just go for it.\n   \n  Battery performance low...   \n  Bluetooth does not work on all devices. Contacted customer care but even they cannot resolve\n   \n  This laptop is decent for gaming and everyday use. If gaming is your primary concern, you won't regret buying this.   \n  Got delivery of HP Pavillion 2 days back, has faulty microphone. What else in days to come???\n   \n  Performance bis good\n   \n  High in performance great laptop only battery issue is there if playing games 2-3 battery life\n   \n  pathetic webcam!\n   \n  Bought it for 63k during the Great Indian Festival days. Got a 1 day delivery promptly on the very next day. As usual, impressive pricing and delivery timing from Amazon.   \n  According to price , the packaging should be good , i felt while unboxing like , im opening old laptop\n   \n  Everything is fine awesome performance, gaming beast. One thing I request to seller please provide good packaging. Otherwise best in the market. HP product quality 100% genuine 🤗.\n   \n  It's a really fast laptop. Less than 8 sec booting up time. 60hz display is OK. 4GB graphics card along with 8GB RAM is enough for decent gaming. But I'm disappointed with the intel i5 9th gen processor, could have gone with AMD Ryzen chips instead. The only problem i faced is with the mouse pad. It's not good built and kinda clicky. Overall built quality is good. But it's  heavy\n   \n  Nice except of the choice of colour for the backlit keys! This one came with a weird purple!   \n  Overall its a nice product.\n   \n  Best one, I love it.\n   \n  Great specs, boots up fast and delivered on time.   \n  Battery performance is not upto the mark rest everything is fine\n   \n  Keyboard letters brightness\n   \n  Product is very good as expected but packing from amazon was not good\n   \n  My First order was some display problem so i ask for an exchange and Amazon delivered today. This time no problem. Best laptop in 61k.\n   \n  Price is little bit high, and sound quality is also poor,, otherwise it's a good choice   \n  Don't think just buy this laptop.   \n  1. bought for 67k. next week price change to 62k. beware of prices when buying online.   \n  Battery is very bad\n   \n  Best laptop for the price of 54,000 INR.   \n  Laptop is good but should come with battery backup because as a gaming laptop  it is to play games on it so it's should be battery backuped\n   \n  Awesome for gaming   \n  Writing this review after using it for using it for 10 months. This is a good performance laptop with nice graphics . The battery life is pretty poor i.e. we only get 2-2.5 hrs and with game just 1.5 hrs . The performance is really good as I could play cyberpunk in ultra settings without much lag. The hinges feel a bit unsteady but good. The keyboard is good. The camera is average with lot of grains and very wide. Heating is one issue I faced a lot but its adjustable. The charging is pretty fast and the SSD is good. I could even play nba 2k21 without any problems. The speakers quality is real good but the decibels is a bit less at times. It is a good buy in its segment and it does give the stability of hp. So my overall review is it best in its segment with really good performance and graphics.\n   \n  I buy this laptop in flipkart  but laptop is good but bettary back very bad only came 3 hours playing games only 2 hours I recommend buy bettary back laptop\n   \n  Hard disk capacity 500GB is very less for such a price.\n   \n  After 1 month of use i am writing review.   \n  I am giving this review after 1 month of usage.   \n  On the first day of usage, SSD makes the fast booting.   \n  What a performance🔥🔥\n   \n  Overall very good.  Absolutely free from heating.  I have one more laptop and this is good, i feel.  Uninstalled MacAfee and installed MaxSure which key costs only rs. 363 (1pc 3yrs) on the very same day of receiving it.  About delivery and its speed, 101% satisfied.\n   \n  Best laptop under 70K for gaming.❤️\n   \n  Very poor performance Amazon service was also very bad\n   \n  laptop design is very good and backlit keyboard is very nice.\n   \n  Its worthy in all aspects for giving good rating\n   \n  It could have been pre-loaded with ms-office student version and anti virus for at least 1 year.\n   \n  Gd lappy for gaming n more\n   \n  Very good deal. Laptop is sleek and looks good considering a gaming laptop. Performance and quality is top notch.\n   \n  Laptop is great but a little heavy\n   \n  Loved the product.. but if microsoft office would be pre-installed then it would be the best ever.\n   \n  Nice speaker design\n   \n  Very good laptop\n   \n  awesome product...bought it offline though ...battery backup is low but thats expected from gaming laptops ...everthing else is top notch....go for the hdd variant if u dont have budget and put a m.2 chip in it .\n   \n  Not booting up after charging for 1 hour for the first time.\n   \n  It's been a  month I'm using this laptop and trust me.. budget wise it's the best! I play csgo mostly and sometimes flight simulation.. csgo it gives about 150 to 180fps on ultra high which is more than enough for a 60hz screen.. and on microsoft flight simulator 2020..I use high end settings which is one level down to ultra max and it's very smooth with a decent fps of 45 to 70 and hardly any stuttering.   \n  The performance is so damn impressive. I did not experience any thermal throttling while playing farcry-5 for 5-6 hours in ultra settings. The thermal is controlled very well.   \n  Boost your gaming\n   \n  Camera quality very poor. Pictures are blurred during video conference\n   \n  Packing is not good and MS Office software is updated and valid copy. As local vender selling with valid software of MS OFFICE 10.\n   \n   I ordered this laptop on 1st of September and got it on 2nd of September. It has been 3 days. This laptop runs really smooth.   \n  Go for it you'll be amazed by looks.\n   \n  The laptop is awesome for gamers and for high load usage for software developers at this price.\n   \n  The product comes with no warranty card. So it is unreliable\n   \n  I got these two dots here I wonder what it is can someone help?!\n   \n  Product is smooth and good but they should give 1 TB HDD at this price. It should've been hybrid drive laptop\n   \n  very good product with SSD but i feel 1TB HDD should be provided with this price range :68K. with ssd.   \n  Good laptop with great specs but the build is plastic and this model does not come with violet backlight but a white backlight\n   \n  Beast\n   \n  This one is best till date at this price....   \n  Overall performance of laptop after 1week of use is better.. Booting time excellent, keypad is good, touchpad is quite noisy from one corner but overall it works smoothly than other laptop.\n   \n  Really love it. One of the best gaming Laptop.\n   \n  Product is great   \n  I am giving this review after two days of usage.   \n  Go for it youll be amazed looking at the laptop.\n   \n  Best Performance Laptop Even tested Far Cry 5 , The graphics is awesome and ssd is there so no issues in Speed.",
    "name": "HP Pavilion Gaming 10th Gen Intel Core i5 Processor 15.6-inch(39.6 cm)..."
  },
  {
    "comment": "   \n  Battery life, display is superb\n   \n  I wish I could say, you get what you pay for. This is not even worth what I paid for.   \n   **The screen wobbling of this laptop in just hyped up, It wobbles only if you move the laptop roughly or when you move the lid roughly and intentionally. The screen doesn't wobbles on rough typing. Therefore screen wobbling is just hyped up.**   \n  I really like how with the competitive price victus come with but built quality could have been better specially hindge, the screen is noticeably wobly, if you are using on desk its fine, if you use on lap or under running fan can easily notice the wobble.\n   \n  Bought this laptop with lots of expectations as specs are very good but it gets freezes for a second randomly which is very irritating. It is happening for normal work. So don't buy this laptop. Very annoying freezing issue and hp customer care not able to resolve this issue.\n   \n   It's just the wobbling issues everyone complaining abt...I know it's there but for a gamer like me it's not an issue since I don't move my laptop 100 tyms a day...it's doesnot wobble under ceiling fan and all like some people mentioned in their reviews...it's been weeks since I bought it... Haven't found any problems....The main thing abt this laptop is that the heat/thermal management....I play for abt 7 hrs or more everyday...in a single stretch 3 or 4 hrs... and all these tyms I haven't had any major temperature strike or low performance issues...the thermal management is pretty damn efficient....the screen is another fact to talk abt...its 100% RGB and very bright compared to many other laptops...it's sound system is also pretty good...but who cares abt sound system since we gamers use headphones all the time while gaming... anyway the laptop have a decent sound system...the wobbling issue is something that we will observe very quickly... especially when we place it on our lap or when we try moving it around or while touching the screen...better not place this laptop on your lap bcz gaming laptops want air supply and the air intake is in the bottom. Placing laptop on your lap is Harmful for us too. The ram is not single 16gb...it 8gb and 8gb in two slots...that's a small disappointment...the laptop have all the ports you will ever need and it also supports dual force...through which you can use wifi and Ethernet simultaneously to increase network speed...even though it is made of plastic..the finishing looks good....it's got hdmi 2.1 which is the latest hdmi port...which support larger video quality and fps...got a nice keyboard which feels simillar to Mac book keyboard...mac book's keyboard is better anyway...got window key lock function and touchpad lock function( mainly used by gamers)...3 USB ports...1 usb type c...hdmi...Ethernet...single port for audio and microphone jack....sd card slot...the keyboard have an white and blue mixed backlight which looks cool...the overall look of the laptop is great...which can be used even for productivity purpose (not over flashy design)... Battery life is 3 out of 5....since it's gaming lap it's recommended to plug and play most of the tyms....personal opinion: Go for it\n   None   \n  Gaming is not better as it stops while playing and battery life is decreasing day by day I want refund for it\n   \n  It's not the best laptop , but really worth for its price and victus is able to manage a no. of high end softwares simultaneously, although haven't checked about games ,but high rendering softwares work fairly without any problems.   \n  The product is really nice. The screen wobble is still there but not too much. The brightness and screen quality is really good. The weight is well distributed and the build Iapetus is pretty good. The battery is not long enough but ok taking into account that it is a productivity laptop. Really worth the price.\n   \n  Great screen, value for money, no issues till now. Let's see further.\n   \n  The display of my newly bought VICTUS by HP has turned faulty on day 10 (see photo).   \n  Cons:   \n  Designed by HP Engineers is the worst thing written on this HP VICTUS laptop.   \n  Good for coding and gaming. Laptop does heat up, but has good thermals. Screen hinge quality is sub-par. Other than that it's a good laptop.   \n  One of the best laptop\n   \n  Decent graphics card and works well on aaa games . Powerful processor geekbench 5 gives 8312 on multi core and 1526 on single core . Satisfactory speakers but not too loud or macbook level . The brightness is satisfactory for normal everyday work and gaming.   \n  I wonder why does people say there is no heating issues. When I keep my fingers at center of laptop keyboard, my fingers are getting burnt. Pergaps keys coming below F5 to F10 (this might be the place where cpu held underneath).   \n  Built quality is awesome as usual by HP.   \n  Pretty good laptop in the price segment. The 100% Srgb display is really good for design works and it has ms office also which is very nice considering a gaming laptop. Thermals are also good.\n   \n  This is a great laptop. Looks sleek and provides ample compute power to handle intensive applications/games without any issues.   \n  This is a Beast in this price segement   \n  Laptop is worth it. Screen wobble is there but its manageable. No heating issue.\n   \n  This laptop easily fit your budget. Overall performance is great & smoothly. No Heating issues noticed till now. CPU & GPU temperature near about 80-85 degrees. Battery Backup 3-4 hrs (Normal usage). Build quality average. Gaming performance very good. No major issues noticed during playing games.\n   \n  Firstly, the laptop had a small scratch on the lid but that doesn't bother me much.   \n  Overall a great laptop for gaming\n   \n  Still buggy ryzen battery 3.5-4 hrs in general usage no heating issues not yet game performance is exceptional 5/5.brightness is ok for indoor display wobble for normal fan speed build quality 3/5. Recommended for hp lovers one thing is clear if we don't want to search for port hub ms office it's free here previously iam using macbook air m1 too hard for a windows user to adapt bit restricted except in weight and battery life there is a bit bugs keynote word numbers not even open shows dailog box whenever I try to open ms office still to acclimatize m1 chip my oneplus phone struggles to connect Mac so it is not my type so I came back to hp previously omen user except in weight everything is ok. So please go for 89k victus which covers most. 100℅ srgb rtx3050....\n   \n  I've had this laptop for about 2 weeks now, so here's my review   \n   I bought this as I got good configuration in this price. But it feels very bad plastic have been used and literally shaking below normal fan speed. I mean I have to work under the shade where there is no wind. I have returned and got it again but with same defect. Also seller written 16GB single slot RAM. But after complaining and return I got same 2 slot 8GB RAM. Screenshot attached. This means I am not able to upgrade it afterwards. Physically yes but basically I have to throw these two 8GB ram and have to purchase and install two16GB. This is very annoying. HP is a good brand but this is not at all satisfactory. I have requested amazon also for double checking these issue and return but they are also not customer friendly at all.\n   \n  Pros   \n  I won’t comment on wobble as I feel it’s exaggerated than what it actually is, everyone following a “trend talk”.   \n  Mrp is  ₹1,08,000...   \n  Wifi hardware is not working. Updated drivers, bios etc. Hp folks promised onsite support. No one has called or visiting. Extremely disappointed and dissatisfied.\n   \n  I like the fact HP provide a laptop with rtx 3050ti + ryzen 7 5800H + best screen of 100%sRGB and also battery life+ owsome build quality (hats off🤠🤟🏻) i.e., quite good 70Whr and much better than 50Whr or 56Whr like many other brands, overall verdict :-Go Ahead and buy it *[screen wobbling is present little bit more because of bigger size of screen may be but hey!! There is no laptop in this range which don't wobble whereas hinge of victus is quite tough no problem with hinge and no flex]\n   \n   Let me start by what I didn't like   \n   The product is awesome no issues with the build quality but there is little shakyness in the screen even if we the laptop is under a ceiling fan.   \n  I was planning to buy this laptop so i went through qna section for the same and saw that ram is 16gbx1.. but when i got the product it is actually 8gbx2. Now if we wish to upgrade it then either of the 8gb Ram will be wasted.   \n   It easily produces 80+ fps in medium graphics on most games. Build quality is good. Doesn't have any major flex neither on screen nor on keyboard. Screen display quality is also great, 100% srbg. ( 3050ti + 5800h). Build feels solid in hand and battery backup on normal usage is upto 5 hrs\n   \n   Hp really should do something to fix screen wobbling issue by recalling to service centers, this issue should be taken seriously as u can see in the video I compared it with my old Asus DM 483 with one broken hinge and there is no wobbling under fan, this is a bad remark on relaibility, This laptop does deserve a five star rating if not for screen wobbling issue, and tested some AAA games on this so far so good, and thermals are really good, CPU maxing at 85°C and GPU At 75°C, and a worthy mention is keyboard which super good for the price range.   None   \n   My initial impression about this product was very good . But after few days it started to show some wired bugs   \n  First, look for the disassembly video on YT. This shows you all the internals and how to upgrade the laptop. From the references to PCIe 4.0, I'm assuming that is the Intel model, as the Ryzen is PCIe 3.0 only. So don't expect the second SSD slot to be PCIe 4. It's not. I haven't used this extensively and not played much, just a few games to test it.   \n  Would have given 5 stars if not for following flaws   \n   For gaming , best build quality, premium quality\n   \n   I just love it... Fast charging features is really very fast. Looks like Charger weight is defining its fast charging features... - ;)\n   \n  It is a beast pc overall\n   \n   THE SCREEN WOBBLES BUT NOT A PROBLEM, CAUSE ACTUALLY SCREEN IS HEAVY , BESIDE THAT PERFORMANCE IS TOP NOTCH SUPERFAST, GAMES RUN SMOOTH NEAR TO 80 FPS, THERMALS ARE EXCELLENT NEVER GONE UP TO 85 DEGREE, THANKS TO @gamingsetupdeals (telegram), for fast delivery trick, thanks amazon for two day delivery.\n   \n  First let's get the elephant out of the house. Does the Screen Wobble? Yes. More than other laptops? Yes. But, it does not wobble while typing or gaming when placed on a table. The price to performance ratio is exceptional. Not only the specs are mind blowing but the display is a treat to our eyes! 🤯 like on a whole new level (3050ti & 3060 version). It smokes any other gaming laptop in terms of battery life. It's just amazing. The keyboard quality came like a shock to me. It's so good that it pleasures your finger while typing. Perfect travel and resistance. It's just smooth! Those were the initial impressions. More in the coming days....\n   \n  Awesome\n   \n  I ordered got it delivered in 15hrs ,which is amazing and the laptop is heavy ,also it has only mid support for the screen so do handle with care , but apart from that the specifications are on point , it's a valid HP product got it verified from the warranty check on HP website.   \n   My Reviews on the Laptop are based on continuous gaming usage for 4 hours. My Laptop is the mid variant 5800H/RTX 3050Ti/16 GB RAM/512 SSD.   \n  Display is really good! (144hz display is a treat to the eyes)..Built quality could have been better(screen is not sturdy it wobbles sometimes but it is very thin with very less bezel which is good)... vents are good, no heating issues...It is a bit heavy 2.5kg weight.....battery life is not very good (4 - 5 hrs max in power saving mode) and also there are two 8gb ram i.e total 16gb ram whereas HP said it comes with one 16gb ram..Ryzen 7 5800H processor is a beast..RTX 3050ti is a very decent graphics card...Overall the performance of this laptop is very good....I think in this budget range it is the best entry level gaming laptop you can get online.\n   \n  TL;DR. It's a 7.5 out of 10.   \n  Everything is perfect in this laptop it's all plastic but still have good thermals. Display quality is nice   \n  Thermals are good, excellent display, decent battery life.\n   \n  Before buying this laptop I used Dell G3 3500 I must say that I am happy to return that and I purchased this Laptop.   \n  First of all I will say a very big Thanks to gaming  setup deals for getting notification that this laptop is in stock  . If u want to know that this laptop is in stock and want to get notification then simply go to telegram and search for gamingsetupdeals and join where u will get lot of loots and deals   \n   I underestimated the screen wobble issue initially but at 90,000, I'm not satisfied with the hinge quality. The screen just moves around with a tiny poke.",
    "name": "Victus by HP Ryzen 7 5800H 16.1-inch(40.9 cm) FHD Gaming Laptop (16GB..."
  },
  {
    "comment": "   \n  Good design with good performance and pretty manageable battery life for gaming and work purpose\n   \n  I liked it all the things of this laptop\n   \n  Laptop is good at this range but the battery 🔋 life 🧬 is not 🚫 good and sound quality is not soo good.  If we use the full the full brightness then battery backup will give 2 to 3 hour\n   \n  Having owned multiple Lenovo products including the ThinkPad; this one is a bit of a let down. Despite now using it for about a week. It continues to be slow & laggy. Something is amiss here in this config; its either windows update which is pushing the system performance down or its the HDD.\n   \n  Only disadvantage of using this laptop is HDD used.. instead of HDD they should provide SSD... 256 GB SSD instead of 1TB HDD\n   \n  Pros:1.display quality is good   \n  I have bought the laptop from offline market for rupees 54000. the laptop runs pretty hot in room temperature of 30 c° . the left side of the laptop gets very hot because the is no fan in the left side.so if you plan on buying this laptop for gaming keep in mind that if you play any game which uses CPU and GPU at the same time like gta 5 , battlefield 5 , warzone then the game will leg pretty badly I mean the game will starter it will give you easily 60 plus FPS but 1% low frame rate will drop below 14 15 FPS so the game will feel stattery and to fix this issue you need to to disable the Xbox gamepass you can find the video online in YouTube if you do that then the laptop is very good to game. after all if you want to buy this laptop then I will say  you go for the the SSD variant because the hard drive is really really slow the computer takes around 25 second to bootup and the if you are buying from offline please check the GPU first I mean to run some benchmark or something to check the GPU is working or not because I had broken machine then I have to return the machine it took me around 15 days . so goodluck\n   \n  Click pad wasn't working properly   \n  Slow and very low battery backup\n   \n  This is a good laptop, for gaming and designing. The laptop finish is premium. Best laptop in this range. And you can upgrade hdd to add and even you upgrade the RAM 8 GB to 16 GB .Only the drawback is the battery life is not good, it work only1.5 hours\n   \n   Best laptop from lenovo\n   \n  I've only used this laptop for a day. The version I bought has only 1TB HDD so it takes around 3 min to completely finish boot and ready to use. No SSD and it's 60hz refresh rate. I only played GTA 5 and I saw no lag and very minor stutters in high quality. The fans were running very fast and yet stayed quiet. I haven't measured the battery life yet.... But I think battery might be around 2-3 hr if you're using only for browsing and YT videos. And maybe 1-2 hr if you're gaming. The screen quality is very good. Overall it's a very nice lappie, and I loved it💙. I bought this for around 50k after exchange and bank offers. So it's worth for this price. Hope i get a SSD soon⚡😅\n   \n  Guys, I understand its a great gaming laptop considering the price,  but no, with the lack of SSD storage I couldn't recommend it in 2021. Luckily it does have an m2 slot for SSD expansion. But for that you will have to go to service center and they will charge you around 5-6k. You can open it by yourself and install but that will void its warranty. So , its better that we go for the SSD variant here amazon.in/dp/B095KQ1G3X",
    "name": "Lenovo IdeaPad Gaming 3 Intel Core i5 10th Gen |15.6 inch(39.6 cm)..."
  },
  {
    "comment": "   \n  Well I purchased it in sale so but for this price range you should check out new asus tuf 2021 series\n   \n  I am really happy with the performance. So far all good.\n   \n  It's wast dabba chaina product, not useful for gamming\n   \n  It's very good for gaming with a stable 60fps in moderate setting for most AAA games. The only downside is the battery, but as a gaming lap it gives better performance when plugged in.\n   \n  Battery : 7.9/10 (Don't expect Notebook Computer like battery. That's why they provide you AC Adapter)   \n  Laptop is smooth like butter. Just one drawback which is it's webcam which claims 720p but in actual it is not even 1 megapixel. Rest I'll post after few months of use.\n   \n  Poor battery life and heating issues.\n   \n  I bought this laptop during the Prime Day Sale for 66K. At this price, I'd say it's a great laptop.   \n  Everything looks good but the camera is ordinary 2mp. Normal for the zoom calls or meetings but not as HD as business laptops\n   \n  BEST LAPTOP IN GTA 5 90-100 FPS ON 1080P VERY HIGH   \n  It is one of the best value gaming laptops out there!   \n  I bought this laptop for 66k and I am fully satisfied with the value for money that I got. But keep in mind that there are some compromises that you have to make, so let's talk about what they are.   \n  All is good till 3 months but sound is no loud this is disadvantage in this laptop\n   \n  It was a very bad experience first the product came out defective then nobody came to pick it up for more than a month i called like hundred times and after 20 pick up fails finally someone did but it was a very exhaustive and time wasting process.\n   \n  One of the Best choice for gaming and work purposes also\n   \n  As part of the product purchase it was mentioned as 1 year warranty. Got this delivered today and it says 6 months warranty pending\n   \n  Super product and performance is a beast\n   \n  Updating my previous feedback regarding warranty support. Raised a request with lenovo and the warranty was extended from 6 months to 12 months. Thanks Lenovo.   \n  Long story short: DON’T BUY EXPENSIVE ELECTRONIC PRODUCTS FROM AMAZON. \"THE SYSTEM\" IS A CHEAT.   \n  Best laptop in this price range\n   \n  Amazing product ❤️\n   \n  Works as expected\n   \n  Laptop is ok for gaming. Sometimes FPS drops so much that playing becomes impossible but after 2-4 mins it works fine. I have tried the same game on another laptop with similar configuration but that's Intel processor laptop and the games run smoothly on that. Sound is low but doesn't matter as I use wireless earphones which connects quickly with this laptop. Overall if you want to play games and want to do some coding with heavy softwares, you can go with this one.\n   \n  So far so good. Time will tell how it will behave in long run. I was about to buy from Amazon. Luckily checked once on Lenovo website, got 5000 cashback with HDFC card, and laptop bag for 1 rupee.   \n  Best laptop in this price range. Thickness is awesome and it's not feel that heavy. Go for it if you hav 65k budjet. Display is good colour looks little washed out because of 45% NTSE. Otherwise it's Awesome. Speaker is not loud even my mobile is 2 times much higher volume so don't expect good in audio but still sound is good and decent. Keyboard is just wow. And seriously this beast is super fast in everything. And it's fan is so silent I can bearly hear. Sometimes I have to stick laptop to my ears to listen that fan is working or not😂. Go for it best in this budjet.\n   \n  I dont need ro say anything just see the pictures and think yourself   \n  Overall the laptop provides great value for money.   \n  Expensive fingerprint magnet with a unbearable amount of yellow tint on the display.   \n  There is a slight coil whine. But for most of the time it's not noticeable.   \n  One of the best budget gaming laptop in 2021, the ryzen 4000 series chipset with Nvidia 1650Ti delivers excellent performance in gaming and video editing. It comes with unicolor blue backlight which I've no issue with. If you're looking for a top notch performance with minimal design in a budget gaming laptop then go for it.\n   \n  This is review after 2 month uses, this device is performance best, only issue i has was device heat when you play graphic intense  games. Apart that everything is beast. I use this device for app development purposes and system easily handle android emulator and android studio with other software.\n   \n  Best laptop in this price segment.\n   \n  I think it is value for money.... awesome game experience as well as display...\n   \n  Value for money but i would suggest go for acer aspire 7 5500U @ 53990 on offer\n   \n  Perfect laptop for gaming as well as programming. Multithreading environment will utilize multicore cpu in programming. It is really nice product to purchase 😊\n   \n  The best laptop if you get it at 66000.   \n  Bought this laptop a month ago and this laptop is a beast. Would consider it as one of the best laptops available in this price segment.   \n  I will use it for Big Data Hadoop demo. Working fine as of now 😊\n   \n  Purchased this laptop on 1st day of this year. Since then its been 1 and half month usage. The laptop has power packed ryzen 5 4600h processor and nvidea gtx 1650ti gpu along with an extension slots provided for both RAM and storage (either add another SSD or add an HDD). Though I am not a  big fan of games and not tested its full performance but I observed following things. It could be issue with my Laptop or something I am missing, I am not really sure. I have observed that WIFI connectivity with Internet is quite slow. I have my WIFI router and all my mobile and another laptop connects to it quickly and I can browse internet as soon as it connects. But in this laptop, though WFI gets connected, but there is no internet for atleast couple of minutes (approx 2-5 min). I am not sure if its an issue with WIFI adaptor in this laptop or some additional settings I have to do. The lag of accessing internet becomes quite frustrating during this non connection time. If anyone faced similar issue where WIFI connects but internet is not accessible for couple of minutes, do comment on response and any solutions for this.\n   \n  The device is quite robust. Decent display adjust the colour temperature would improve the whites. Its by default a bit warm. The ram is a bit low for gaming so upgrading to 16gb is recommended.\n   \n  Powerful processor and GPU makes it 10X better!!!!!\n   \n  The processor is far superior than I5. Your search for a budget gaming laptop that can also help you with video editing ends here. Beast machine!   \n  Great laptop with very good specs. Clean and classic looks, with soothing blue backlit keyboard. Have been using it for a month, totally satisfied with the purchase. Good speed (boot time of just 2.8 sec) and smooth functions with handy utilities from Lenovo. Really appreciate the extended on-site warranty option with ADP. You can simply extend the RAM if required. Other performance specs are admirable; scores about 7388 pts in Cinebench R23 (multi-core stress test) and runs Unigine Heaven 4.0 (GPU stress) pretty well. The only con would be the disk partition; only one partition (C: drive) is present.\n   \n  Been using the laptop for over a month now. No complaints performance-wise. Runs almost all AAA games at or over 60 fps at ultra settings. The upper keyboard rows do get a bit warm, but it doesn't cause an issue while using the laptop. Overall great product from Lenovo.\n   \n  Powerful,smooth,super fast,Nvdia graphic is good enough for Gaming. I will recommend this laptop for 60k budget.   \n  Nice product i liked it very much. Its far better that what u get in this price range. Thermals are great\n   \n  Just great value for money..... Go for it... U will not get ryzen 4th gen in this price point alongside gtx 1650ti........and yess ryzen 4th gen arr much morr better than intrl i5 gens.....   \n  Excellent performance for a laptop.   \n  I got it yesterday, till now I've done almost everything to check it (running the benchmark test, etc.), I'll summarise my experience as shortly as possible.   \n  Best gaming Laptop under this price range.\n   \n  If u are searching for a gaming laptop then go for it. what are u wait for this is really h beast of all gaming laptop under this buget amazing laptop I got brought this from showroom from same price but 1000 rps more for temper and bag and all and over all performance   \n  Better deal but most things should be clarified   \n  Here's what I loved:   \n  I had received this laptop today. Price wise, its higher than the showroom price by 2k.  When purchasing through showroom, you get a bag along with it. But, amazon gave a good deal for an exchange, hence I opted this route.   \n  Nice look. Best performance. Best graphic card . 2 fan . Super budget laptop best hai under 60k range thanks lenevo\n   \n  Color accuracy is a nightmare. But what do you even expect from a 65k laptop. If you have something like 75-80k, go for something else.   \n  Asus TUF is better option... Price is very very high.   \n  So even though performance wise the laptop is great but it has major issues on battery.The cpu gets throttled to 0.38 Ghz even when the temperature is moderately cold.However the issue can be fixed if you move to a warmer area\n   \n  Undoubtedly the best laptop within 65K. I am really glad that I chose this product instead of going with the other options like Asus or HP.   \n  Performance is excellent. Compact design, looks brilliant. Battery back is amazing, last for 5 hours plus with Medium Usage.   \n  good battery life, great at gaming and pretty quiet during normal usage. While gaming it does a good job at staying cool. Just upgrade the ram to 16 gigs and you're good to go. Can play all AAA titles at 60 fps on medium - high settings @1080p.\n   \n  The best entry level gaming laptop. Loved it.\n   \n  Pros:   \n  Its day 1 of purchase,will give review after a week or month...till then,it looks pretty solid machine\n   \n  Out of 10   \n  Latest AMD Renoir Ryzen 5 4600H with 6 cores and 12 threads is so much better than quad core Intel 10th gen i5 CPUs at a lower cost. 1650Ti is a superb graphic card capable of running most games at 60 fps. 8GB. Super fast DDR 4 RAM and 512Gb SSD ensure super fast boot time. No one should buy a gaming laptop without SSD in 2020. All of this at a great price point as well. I would have loved to see a higer refresh rate screen. Probably the only downside to this laptop as this processor + GPU combination is really superb. Highly recommend at this price point.\n",
    "name": "Lenovo IdeaPad Gaming 3 AMD Ryzen 5 4600H 15.6 inch(39.6 cm) Full HD..."
  }
]
